Revit 2027 API
TableCellStyle.IsFontBold Property
 Gets or sets whether the text font is set to bold of this cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFontBold { get; set; }
Public Property IsFontBold As Boolean
	Get
	Set
public:
property bool IsFontBold {
	bool get ();
	void set (bool value);
}
member IsFontBold : bool with get, set
Property Value
Boolean
 true if the font is bold; otherwise false.
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace